[
    {
        "title": "catus-clock",
        "description": {
            "en": "Hand-coded analog clock. No canvas, just CSS transforms and a raw 100ms setInterval. Pre-AI Angular experimentation.",
            "fr": "Horloge analogique en CSS. Animation par transforms CSS et setInterval de 100ms, sans Canvas. Expérimentation Angular sur la gestion du temps pour afficher l'heure avec une précision brute.",
            "mx": "Reloj analógico codificado a mano. Sin canvas, solo transformaciones CSS y un setInterval crudo de 100ms. Experimentación Angular pre-IA.",
            "ht": "Revèy ak zegwi mwen fè a la men. Mwen pa itilize canvas, jis CSS transform ak yon setInterval 100ms. Se te lè m t ap aprann Angular."
        },
        "url": "https://github.com/mtldev514/catus-clock",
        "visibility": "private",
        "date": "2026-02-10",
        "category": "projects"
    },
    {
        "title": "moody",
        "description": {
            "en": "Web archaeology. Mood tracking by demographics (age/gender). Angular frontend hitting a REST API (likely wrapping legacy SOAP/Java).",
            "fr": "Tracking d'humeur Angular. Analyse les tendances par segments démographiques (âge/genre). Utilise une façade REST pour consommer des données provenant d'un backend SOAP/Java legacy.",
            "mx": "Arqueología web. Rastreo de humor por demografía. Frontend Angular consumiendo API REST (probablemente envolviendo SOAP/Java legado).",
            "ht": "Yon ansyen pwojè. Mwen te konn swiv imè moun selon laj ak sèks yo. Frontend lan fèt an Angular, li pale ak yon API REST (ki sanble kache yon vye sistèm Java)."
        },
        "url": "https://github.com/mtldev514/moodyWebApp",
        "visibility": "private",
        "date": "2019-01-01",
        "category": "projects"
    },
    {
        "title": "tdiar",
        "description": {
            "en": "Discipline factory. Full-stack Angular/NestJS. Manages frequencies, streaks, and completion states to engineer structure against chaos.",
            "fr": "Tracker de récurrence Angular/NestJS. Système de suivi d'habitude pour calculer les états de complétion et transformer des habitudes répétitives en données structurées.",
            "mx": "Fábrica de disciplina. Full-stack Angular/NestJS. Gestiona frecuencias, rachas y estados de finalización para estructurar el caos.",
            "ht": "Yon machin pou disiplin. Tout bagay fèt an Angular ak NestJS. Li jere frekans, seri siksè, ak eta fini pou mete lòd nan dezòd."
        },
        "url": "https://github.com/mtldev514/tdiar",
        "visibility": "private",
        "date": "2026-02-10",
        "category": "projects"
    },
    {
        "title": "carabiner",
        "description": {
            "en": "Community calendar. Modern Next.js stack with Supabase. Direct DB/Auth integration via Supabase client. Built for connection.",
            "fr": "Calendrier communautaire Next.js/Supabase. Plateforme de partage d'événements. Utilise le client Supabase pour l'auth et la base de données afin de connecter les membres d'un groupe en temps réel.",
            "mx": "Calendario comunitario. Stack moderno Next.js con Supabase. Integración directa de DB/Auth vía cliente Supabase. Hecho para conectar.",
            "ht": "Kalandriye pou kominote a. Fèt ak Next.js ak Supabase. Li konekte dirèk ak baz done a. Fèt pou rasanble moun."
        },
        "url": "https://github.com/mtldev514/carabiner",
        "website": "https://carabiner.gay/fr",
        "visibility": "public",
        "date": "2025-08-29",
        "category": "projects"
    },
    {
        "title": "masked",
        "description": {
            "en": "Identity swapping game. Core logic uses a while-loop and lodash.shuffle to ensure no player gets their own name. Angular + Firebase.",
            "fr": "Échange d'identités Firebase/Angular. Joue avec tes amis. Vos identités sont mélangées et vous devez deviner qui se cache derrière qui. Système de jeu asynchrone en temps réel.",
            "mx": "Juego de intercambio de identidades. Lógica central usa while-loop y lodash.shuffle para asegurar que nadie reciba su propio nombre. Angular + Firebase.",
            "ht": "Jwèt kote nou chanje non. Mwen itilize yon bouk while ak lodash.shuffle pou asire pèsonn pa jwenn pwòp non pa yo. Fèt ak Angular + Firebase."
        },
        "url": "https://github.com/mtldev514/masked",
        "visibility": "private",
        "date": "2026-02-10",
        "category": "projects"
    },
    {
        "title": "import-photos",
        "description": {
            "en": "Selective RAW importer for photo workflows. Reads XMP ratings/labels, copies only keeper files, verifies integrity, and keeps an import history to avoid repeats.",
            "fr": "Importateur RAW sélectif pour workflow photo. Lit les notes/labels XMP, copie seulement les fichiers retenus, vérifie l'intégrité, et garde un historique pour éviter les doublons.",
            "mx": "Importador selectivo de RAW para flujo fotográfico. Lee estrellas/etiquetas XMP, copia solo los archivos buenos, verifica integridad y guarda historial para evitar reimportes.",
            "ht": "Yon zouti entelijan pou enpòte RAW nan workflow foto. Li not ak label XMP, li kopye sèlman bon fichye yo, li verifye entegrite, epi li kenbe istwa pou evite doublon."
        },
        "url": "https://github.com/mtldev514/import-photos",
        "visibility": "public",
        "date": "2026-02-11",
        "category": "projects"
    }
]
